VladimirP1/si1000-rf-beacon/extlibs/MCU/Examples/C8051F85x_86x/CRC/F85x_CRC0.c
//-----------------------------------------------------------------------------
// F85x_CRC0.c
//-----------------------------------------------------------------------------
// Copyright (C) 2013 Silicon Laboratories, Inc.
// http://www.silabs.com
//
// Program Description:
//
// This program shows how to use the CRC engine in the automatic mode and the
// manual mode. The automatic mode can be used to calculate the CRC of flash
// pages. The manual mode can be used to calculate the CRC of any number of
// bytes manually written to the CRC engine.
//
// This program calculates the 16-bit CRC of the number of flash pages found in
// the global constant section. The first section uses the manual method to
// calculate the CRC of all bytes except the last four. The last four bytes
// store the resulting CRC value. The second section uses the automatic CRC
// feature to calculate the entire CRC, including the result stored in the last
// four bytes of the last flash pages. The final resulting CRC should be 0.
//
// NOTE: The block size of the CRC module is half the flash page size.
//       The CRC block size is 256 bytes and the Flash page size is 512 bytes.
//
// How To Test:
//
// 1) Ensure shorting blocks are place on the following:
//    - J27: DS5 P1.0 - P1.0
//    - J27: DS6 P1.1 - P1.1/ADC0.9
//    - JP2
// 2) Place the SW1 switch in the +3.3V_VREG position and power the board
//    using the J6 power connector.
// 3) Compile and download code to the 'F85x UDP MCU board.
// 4) Run the code. If the DS5 P1.0 LED is ON, the program is working.
//                  If the DS6 P1.1 LED is ON, a CRC error was detected.
//                  If both LEDs are off, the program did not run to
//                    completion.
//
//
// Target:         F85x/86x
// Tool chain:     Keil ,Raisonance, SDCC
// Command Line:   None
//
// Release 1.1 (TP)
//    - Updated descriptions and comments
//    - 24 JUL 2013
//
// Release 1.0
//    -Initial Revision (TP)
//    -19 FEB 2013
//

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------

#include <compiler_defs.h>             // compiler declarations
#include <C8051F850_defs.h>            // SFR declarations

//-----------------------------------------------------------------------------
// Global CONSTANTS
//-----------------------------------------------------------------------------

#define SYSCLK            24500000/8   // SYSCLK frequency in Hz

SBIT (LED1, SFR_P1, 0);                // DS5 P1.0 LED
SBIT (LED2, SFR_P1, 1);                // DS6 P1.1 LED

#define LED_ON            0
#define LED_OFF           1

#define FLASH_PAGE_SIZE   512          // Flash page size in Bytes
#define START_PAGE        2            // Index of the Flash page to start the
                                       // auto calculation. The starting
                                       // address can be calculated by
                                       // FLASH_PAGE_SIZE * START_PAGE

#define PAGES_TO_CRC      5            // Defines the number of pages to CRC

UU16 CRC_Result;                       // Will store the CRC results

// The following three pointers are used to pass a pointer into the Byte CRC
// function. This allows for an array of bytes from any of the three memory
// space below to be fed into the CRC engine.
VARIABLE_SEGMENT_POINTER (Code_PTR, U8, SEG_CODE);
VARIABLE_SEGMENT_POINTER (Xdata_PTR, U8, SEG_XDATA);
VARIABLE_SEGMENT_POINTER (Data_PTR, U8, SEG_DATA);

U16 Number_Of_Bytes;                   // Number of consecutive bytes to CRC.
                                       // This is used with the three segment
                                       // pointers above.

//-----------------------------------------------------------------------------
// Function PROTOTYPES
//-----------------------------------------------------------------------------

void Port_Init (void);

void Auto_CRC16 (U8 Start_Page, U8 Pages_to_CRC);
void Byte_CRC16 (U8* Start_Byte, U16 Num_Bytes);
void Read_CRC16 (UU16* Result);

void Write_CRC_to_Flash (void);
void FLASH_PageErase (U16 addr);
void FLASH_ByteWrite (U16 addr, U8 byte);
void FLASH_SetKeys (void);

//-----------------------------------------------------------------------------
// MAIN Routine
//-----------------------------------------------------------------------------
void main (void)
{
   // Disable the watchdog timer
   WDTCN = 0xDE;
   WDTCN = 0xAD;

   CRC_Result.U16 = 0x0000;
   Port_Init ();

   LED1 = LED_OFF;
   LED2 = LED_OFF;

   // Calculate arguments passed into the Byte_CRC16 function
   Code_PTR = FLASH_PAGE_SIZE * START_PAGE;
   Number_Of_Bytes = (FLASH_PAGE_SIZE * PAGES_TO_CRC) - 2;

   // Manually calculate CRC
   Byte_CRC16(Code_PTR, Number_Of_Bytes);
   Read_CRC16(&CRC_Result);

   // Write the CRC result to last bytes of last page that is used in CRC
   // calculation
   Write_CRC_to_Flash();

   // Calculate CRC including the CRC value written to the last bytes of the
   // last page.
   // Since the Block size of the F85x/86x is 256 (or half the flash page
   // size), multiply by two.
   Auto_CRC16 ((2*START_PAGE), (2*PAGES_TO_CRC));
   Read_CRC16(&CRC_Result);

   // If the CRC was calculated correctly, the resulting CRC will be 0.
   // If the CRC is not 0, then the CRC that was written in the Byte_CRC is
   // incorrect
   if (CRC_Result.U16 == 0x00)
   {
      LED1 = LED_ON;
      LED2 = LED_OFF;
   }
   else
   {
      LED1 = LED_OFF;
      LED2 = LED_ON;
   }

   while (1);
}

//-----------------------------------------------------------------------------
// Port_Init
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   : None
//
// This function configures the crossbar and ports pins.
//
// P1.0 - LED1 (push-pull output)
// P1.1 - LED2 (push-pull output)
//
//-----------------------------------------------------------------------------
void Port_Init (void)
{
   P1MDOUT |= 0x03;                    // Enable LEDs as push-pull outputs

   XBR2 = 0x40;                        // Enable crossbar and enable
                                       // weak pull-ups
}

//-----------------------------------------------------------------------------
// Auto_CRC16
//-----------------------------------------------------------------------------
//
// Return Value:  None
// Parameters   :
//   1) U8 Start_Page - Starting page of Flash memory to CRC. The starting
//         address of the first page is (FLASH_PAGE_SIZE * Start_Page)
//   2) U8 Pages_to_CRC - Number of pages in Flash to CRC. This determines the
//         total numbero of pages to CRC. If this is set to 1, the only Flash
//         page that will be included in the CRC is the Start_Page.
//
//  After this function completes, the CRC result is available in CRC0DAT.
//
//-----------------------------------------------------------------------------
void Auto_CRC16 (U8 Start_Page, U8 Pages_to_CRC)
{
   bit EA_save;

   EA_save = EA;
   EA = 0;

   // Initialize CRC result to 0x0000 and clear the current result.
   // If the result should be initialized to 0xFFFF, set CRC0CN |= 0x04 before
   // CRC0CN |= 0x08
   CRC0CN |= 0x08;

   // Set the starting page
   CRC0AUTO = Start_Page;

   // Set the number of pages
   CRC0CNT = Pages_to_CRC;

   // Set AUTOEN to enable automatic computation
   CRC0AUTO |= 0x80;

   // Write a dummy value to CRC0CN to start computation
   CRC0CN &= ~0x03;

   // Follow AUTO CRC with benign 3-byte opcode
   CRC0AUTO &= ~0x80;                  // Clear AUTOEN

   EA = EA_save;
}

//-----------------------------------------------------------------------------
// Byte_CRC16
//-----------------------------------------------------------------------------
//
// Return Value:  U8 - returns value indicating if the App FW is valid.
//   1) U8* Start_Byte - Pointer to first byte of data to CRC
//   2) U16 Num_Bytes - Number of consecutive bytes to include in the CRC
//
//  After this function completes, the CRC result is available in CRC0DAT.
//
//-----------------------------------------------------------------------------
void Byte_CRC16 (U8* Start_Byte, U16 Num_Bytes)
{
   U16 i;

   // Initialize CRC result to 0x0000 and clear the current result.
   // If the result should be initialized to 0xFFFF, set CRC0CN |= 0x04 before
   // CRC0CN |= 0x08
   CRC0CN |= 0x08;

   for (i = 0; i < Num_Bytes; i++)
   {
      CRC0IN = Start_Byte[i];
   }
}

//-----------------------------------------------------------------------------
// Read_CRC16
//-----------------------------------------------------------------------------
//
// Return Value : None.
// Parameters   :
//   1) U8* Result - Stores CRC into 2 bytes starting at this location
//
// Copies CRC result to two bytes starting at the location passed into this
// function.
//
//-----------------------------------------------------------------------------
void Read_CRC16 (UU16* Result)
{
   // Initialize CRC0PNT to access bits 7-0 of the CRC result
   CRC0CN &= ~0x01;

   // With each read of CRC0DAT, the value in CRC0PNT will toggle
   (*Result).U8[LSB] = CRC0DAT;
   (*Result).U8[MSB] = CRC0DAT;
}

//-----------------------------------------------------------------------------
// Write_CRC_to_Flash
//-----------------------------------------------------------------------------
//
// Return Value:  None.
// Parameters:    None
//
//-----------------------------------------------------------------------------
void Write_CRC_to_Flash (void)
{
   U16 end_address;
   end_address = (FLASH_PAGE_SIZE * (START_PAGE + PAGES_TO_CRC))-2;

   // The resulting CRC will be stored in last 2 bytes of the last page of
   // flash.

   // First erase last page where CRC will be written to.
   // The original CRC calculation assumes this page is blank (all 0xFF)
   FLASH_SetKeys ();
   FLASH_PageErase(end_address);

   FLASH_SetKeys();
   FLASH_ByteWrite (end_address++, CRC_Result.U8[MSB]);
   FLASH_SetKeys();
   FLASH_ByteWrite (end_address++, CRC_Result.U8[LSB]);
}

//-----------------------------------------------------------------------------
// FLASH_ByteWrite
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   :
//   1) FLADDR addr - address of the byte to write to
//                    valid range is from 0x0000 to 0x1FFF for 8 kB devices
//                    valid range is from 0x0000 to 0x0FFF for 4 kB devices
//                    valid range is from 0x0000 to 0x07FF for 2 kB devices
//   2) char byte - byte to write to flash.
//
// This routine writes <byte> to the linear flash address <addr>.
//
//-----------------------------------------------------------------------------
void FLASH_ByteWrite (U16 addr, U8 byte)
{
   U8 EA_save = IE;                    // Preserve EA
   SEGMENT_VARIABLE_SEGMENT_POINTER (pwrite, U8, SEG_XDATA, SEG_DATA);

   EA = 0;                             // Disable interrupts

   VDM0CN = 0x80;                      // Enable VDD monitor


   RSTSRC = 0x02;                      // Enable VDD monitor as a reset source

   pwrite = (char xdata *) addr;

   // Keys are set in Flash_SetKeys();

   PSCTL |= 0x01;                      // PSWE = 1

   VDM0CN = 0x80;                      // Enable VDD monitor

   RSTSRC = 0x02;                      // Enable VDD monitor as a reset source

   *pwrite = byte;                     // Write the byte

   PSCTL &= ~0x01;                     // PSWE = 0

   if ((EA_save & 0x80) != 0)          // Restore EA
   {
      EA = 1;
   }
}

//-----------------------------------------------------------------------------
// FLASH_PageErase
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   :
//   1) FLADDR addr - address of any byte in the page to erase
//                    valid range is from 0x0000 to 0x1FFF for 8 kB devices
//                    valid range is from 0x0000 to 0x0FFF for 4 kB devices
//                    valid range is from 0x0000 to 0x07FF for 2 kB devices
//
// This routine erases the flash page containing the linear flash address
// <addr>.  Note that the page of flash page containing the Lock Byte cannot be
// erased if the Lock Byte is set.
//
//-----------------------------------------------------------------------------
void FLASH_PageErase (U16 addr)
{
   U8 EA_save = IE;                    // Preserve EA

   SEGMENT_VARIABLE_SEGMENT_POINTER (pwrite, U8, xdata, data);

   EA = 0;                             // Disable interrupts

   VDM0CN = 0x80;                      // Enable VDD monitor

   RSTSRC = 0x02;                      // Enable VDD monitor as a reset source

   pwrite = (char xdata *) addr;

   // Keys are set in Flash_SetKeys();

   PSCTL |= 0x03;                      // PSWE = 1; PSEE = 1

   VDM0CN = 0x80;                      // Enable VDD monitor

   RSTSRC = 0x02;                      // Enable VDD monitor as a reset source
   *pwrite = 0;                        // Initiate page erase

   PSCTL &= ~0x03;                     // PSWE = 0; PSEE = 0

   if ((EA_save & 0x80) != 0)          // Restore EA
   {
      EA = 1;
   }
}

//-----------------------------------------------------------------------------
// FLASH_SetKeys
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   : None
//
// This routine sets the two required Flash keys for writes and erases.
//
//-----------------------------------------------------------------------------
void FLASH_SetKeys (void)
{
   FLKEY  = 0xA5;                      // Key Sequence 1
   FLKEY  = 0xF1;                      // Key Sequence 2
}

//-----------------------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------------------